{
  "language_name": "English",
  "global": {
    "siteName": "Nicolas Loisy",
    "loading": "Loading...",
    "noContent": "No content found",
    "yes": "Yes",
    "no": "No",
    "redirectCertif": "View certification",
    "redirectProject": "View project"
  },
  "welcome": "Welcome to our application",
  "homepage": {
    "title": "Homepage",
    "description": "This is the homepage.",
    "downloadcv": "Download CV",
    "downloadmemoire": "Download Thesis"
  },
  "profile": {
    "name": "Nicolas Loisy",
    "title": "Web Developer & AI Integrator"
  },
  "social": {
    "github": "https://github.com/Nicolas-Loisy",
    "huggingface": "https://huggingface.co/Nicolas-Loisy",
    "linkedin": "https://www.linkedin.com/in/nicolas-loisy/",
    "email": "nicolas.loisy@yahoo.fr"
  },
  "about": {
    "title": "About Me",
    "description": "I am a web developer passionate about computing as a whole.<br />My curiosity drives me to explore various fields such as technology, artificial intelligence, and electronics.<br />I enjoy finding solutions to technical problems and taking on challenges.<br /><br />Every day, I have the chance to work in a stimulating environment where I can apply my skills while constantly learning.<br />My passion for computing and technology allows me to take pleasure in creating and innovating, while enriching myself with knowledge and experiences.<br />My goal is to continue evolving in this fascinating field."
  },
  "skills": {
    "title": "Skills"
  },
  "experience": {
    "title": "Experiences",
    "date1": "09/2023 - Present",
    "title1": "Python Developer & AI Integrator - Eurelis",
    "description1": "Development of AI chatbots with RAG system • Prompt engineering • Scraping<br />LlamaIndex • Langchain • Huggingface • GPT • JS<br />Tools: GIT • Jira",
    "date2": "09/2022 - 09/2023",
    "title2": "PHP & Symfony Developer - Eurelis",
    "description2": "Development of a backend and a client portal PHP/Symfony • TMA and various evolutions on the OSAC.AERO site<br />PHP • Symfony • JS • MySQL • Jira <br />Tools: Docker • GIT • Mantis Bug Tracker • SonarQube",
    "date3": "04/2022 - 07/2022",
    "title3": "PHP & Symfony Developer - Eurelis",
    "description3": "Development of a backend and a client portal PHP/Symfony • Integration into a Symfony development team • TMA and ticket processing<br />PHP • Symfony • Twig • HTML • CSS"
  },
  "diplome": {
    "title": "Degrees",
    "date1": "2023 - 2025",
    "title1": "Master MIAGE - Université Paris Cité (Descartes)",
    "description1": "Master MIAGE - Specialization: Data valorization and protection.<br/> Dual competence in project management, management, and development, with expertise in data management.",
    "date2": "2022 - 2023",
    "title2": "L3 MIAGE - IUT Paris Cité (Descartes)",
    "description2": "Acquisition of dual competence in project management and software development, preparing for technical and organizational responsibilities.",
    "date3": "2020 - 2022",
    "title3": "DUT Informatique - IUT de Montreuil",
    "description3": "Mastery of Java, C, PHP, SQL, Bash, as well as network concepts, design patterns, security, and algorithmic logic.",
    "date4": "2020",
    "title4": "Scientific Baccalaureate - Lycée Diderot",
    "description4": "General education in sciences."
  },
  "certification": {
    "title": "Certifications",
    "title1": "JavaScript Certification",
    "description1": "Comprehensive certification covering advanced topics in JavaScript.",
    "year1": "2023",
    "title2": "Python Certification",
    "description2": "Comprehensive certification covering advanced topics in Python.",
    "year2": "2024",
    "title3": "ChatGPT & Langchain Certification",
    "description3": "Certification on Langchain, ChatGPT, and mastery of RAG systems.",
    "year3": "2024",
    "title4": "Sinequa Certified Professional - Associate Certificate",
    "description4": "Certificate of completion for the \"Sinequa: Associate (2025.1) Certification Path\" delivered by Sinequa University. \nSummary: Enterprise search engine, Sinequa's vision, architecture, security, NLP, and platform indexing.",
    "year4": "October 24, 2025",
    "title5": "Sinequa V11 Practical Basics Certificate",
    "description5": "Certificate of completion for the \"Sinequa: Practical Basics Certification (2025.3 - 11.13)\" delivered by Sinequa - Center of Excellence. \nSummary: Sinequa architecture, connectors, indexing, SBA UI, and search features.",
    "year5": "October 24, 2025",
    "title6": "Sinequa Certified Professional - Design Specialist Certificate",
    "description6": "Certificate of completion for the 'Sinequa: Design Specialist (2025.1) Certification Path' delivered by Sinequa University.\nSummary: Sinequa architecture and security, connectors, indexing, NLP, engine, search features, SBA, plugins, web services, and product considerations.",
    "year6": "October 30, 2025"
  },
  "terminal": {
    "text1": "Hello, world!",
    "text2": "AI Integrator",
    "text3": "PHP Developer",
    "text4": "Symfony Developer",
    "text5": "We love Eurelis! ♡",
    "text6": "Education: MIAGE",
    "text7": "Documentation, my passion!",
    "text8": "MarkIA = MarkDown + AI",
    "text9": "sudo rm -rf /*"
  },
  "linkedin": {
    "title": "My LinkedIn Posts"
  },
  "projects": {
    "title": "My Projects",
    "exploreButton": "Learn more",
    "backToProjects": "Back to projects",
    "detailSections": {
      "overview": "Overview",
      "features": "Key Features",
      "techStack": "Technologies",
      "challenges": "Technical Challenges"
    },
    "glados": {
      "title": "GLaDOS",
      "subtitle": "When Portal's AI controls your home",
      "date": "2025",
      "description": "What if GLaDOS, the cult sarcastic AI from the game Portal, became your home voice assistant?\n\nThis project gives GLaDOS a voice and personality and lets it control a connected local environment running on a Raspberry Pi 5. Multimodal interaction (voice, Discord, web), custom TTS, local home automation (IR, GPIO, Bluetooth) and privacy-first design. Technologies: Picovoice, Piper, LlamaIndex, ReAct, IR LEDs, GPIO, Bluetooth, Pi 5.",
      "longDescription": "GLaDOS is an ambitious personal project that transforms the iconic AI from the game Portal into a real home voice assistant. The goal was to create a complete multimodal interaction system: voice commands with wake word, Discord integration, and a web interface. Everything runs entirely on a Raspberry Pi 5 to ensure data privacy.\n\nThe system uses Picovoice for wake word detection, Piper for text-to-speech with GLaDOS's personality, and LlamaIndex coupled with a ReAct agent for reasoning and executing home automation actions.",
      "features": ["Multimodal interaction: voice wake word, Discord commands, and web interface", "Custom text-to-speech with GLaDOS personality (Piper TTS)", "Local home automation via infrared LEDs, GPIO, and Bluetooth", "Privacy-first architecture: everything runs locally on Raspberry Pi 5", "ReAct agent with LlamaIndex for reasoning and action execution", "Wake word detection with Picovoice"],
      "challenges": "The main challenge was running the entire pipeline (STT, LLM, TTS, home automation) on a Raspberry Pi 5 with acceptable performance. Optimizing latency between voice commands and GLaDOS responses required significant work on the audio pipeline and response streaming."
    },
    "featureEngineering": {
      "title": "LLM4FE - Feature Engineering",
      "subtitle": "Automation of feature engineering with AI",
      "date": "2025",
      "description": "Development of a system for automating feature engineering for machine learning. Utilization of language models to generate relevant features from raw data.",
      "longDescription": "LLM4FE is a research project exploring the use of large language models (LLMs) to automate the feature engineering process in machine learning. The system analyzes raw data, understands its semantics, and automatically generates relevant feature transformations to improve predictive model performance.",
      "features": ["Automatic feature generation from raw data via LLM", "Semantic analysis of columns and relationships between variables", "Automated transformation and evaluation pipeline", "Integration with existing scikit-learn workflows"]
    },
    "tweetLearning": {
      "title": "TweetEmotion - Machine Learning",
      "subtitle": "Classification of tweets by emotions using logistic regression",
      "date": "2025",
      "description": "Creation of a machine learning model to classify tweets based on their emotions. Preprocessing, vectorization, and supervised model training for sentiment analysis.",
      "longDescription": "TweetEmotion is a supervised machine learning project that classifies tweets based on the emotions they express. The complete pipeline includes text preprocessing (cleaning, tokenization, lemmatization), TF-IDF vectorization, and training a multiclass logistic regression model. The project includes an evaluation phase with confusion matrix and performance metrics.",
      "features": ["Complete NLP preprocessing: cleaning, tokenization, lemmatization", "TF-IDF vectorization for text representation", "Multiclass logistic regression model", "Evaluation with confusion matrix and detailed metrics"]
    },
    "enigma": {
      "title": "Enigma",
      "subtitle": "University project on cryptology",
      "date": "2025",
      "description": "Reproduction of the Enigma machine logic as part of a university project. This project aims to understand and implement the cryptology concepts used by the Enigma machine."
    },
    "ePortfolio": {
      "title": "ePortfolio",
      "subtitle": "Interactive personal portfolio",
      "date": "2024",
      "description": "Development of an interactive personal portfolio designed to showcase my technical skills, professional experiences, and personal projects. This project was developed with React and TypeScript.",
      "longDescription": "This interactive portfolio is a modern React/TypeScript application that dynamically presents my professional journey, skills, and achievements. The site supports dark/light mode, internationalization (FR/EN), and is fully responsive. It is hosted on a Raspberry Pi via Firebase Hosting.",
      "features": ["Responsive interface with mobile support", "Dark and light mode with persistence", "Full internationalization (French / English)", "Animated terminal with scrolling text", "Anchor navigation with arrows", "Hosting on Raspberry Pi via Firebase"]
    },
    "markIA": {
      "title": "MarkIA",
      "subtitle": "Technical documentation site with AI",
      "date": "2024",
      "description": "Development of a web platform for writing and storing documentation integrating artificial intelligence to simplify search. The project includes a chatbot powered by a knowledge base (the documentation) and a RAG (Retrieval-Augmented Generation) system.",
      "longDescription": "MarkIA is an AI-augmented technical documentation web platform. It enables writing, storing, and intelligent search within Markdown documentation. The system integrates an AI chatbot that uses a RAG (Retrieval-Augmented Generation) system to answer user questions based on the knowledge base constituted by the documentation.",
      "features": ["Integrated Markdown editor for documentation writing", "AI chatbot with RAG (Retrieval-Augmented Generation) system", "Semantic search across the knowledge base", "Authentication and user management via Firebase", "Documentation storage in MongoDB", "Integration with Langchain and Hugging Face for the AI pipeline"]
    },
    "jobo": {
      "title": "JOBO",
      "subtitle": "Mobile app to promote industrial jobs and Made in France",
      "date": "2024",
      "description": "Creation of an innovative mobile application that recognizes objects via the camera and identifies the craftsmanship or industrial jobs involved in their manufacture. Developed with React Native and an AI vision model.",
      "longDescription": "JOBO is a React Native mobile application that uses computer vision to recognize everyday objects and identify the craftsmanship and industrial jobs involved in their manufacture. The goal is to promote Made in France and industrial know-how by allowing users to discover the trades behind the objects around them.",
      "features": ["Object recognition via camera using AI vision model", "Database of industrial and craft trades", "Intuitive React Native mobile interface", "Backend API with MongoDB and Hugging Face"]
    },
    "meteoApp": {
      "title": "MeteoApp",
      "subtitle": "Weather alert mobile application",
      "date": "2023",
      "description": "A customizable application to alert users about extreme weather events in their region. Includes real-time notifications and local weather forecasts.",
      "longDescription": "MeteoApp is a React Native mobile application designed to alert users about extreme weather events in their region. The application offers real-time notifications, customizable local weather forecasts, and an intuitive interface for tracking weather conditions."
    },
    "eMortels": {
      "title": "eMortels",
      "subtitle": "Platform for the French Academy",
      "date": "2023",
      "description": "Design and development of an educational platform to promote mastery of the French language. This project offers interactive exercises and access to linguistic resources.",
      "longDescription": "eMortels is an educational web platform designed to promote mastery of the French language. Developed with React, Node.js, and MongoDB, it offers interactive exercises and access to linguistic resources from the French Academy."
    },
    "discordPiBot": {
      "title": "DiscordPiBot",
      "subtitle": "Discord bot for home automation",
      "date": "2022",
      "description": "A multifunctional Discord bot hosted on a Raspberry Pi, designed to control home automation devices and automate tasks in a Discord server. Written in Python for flexible and modular GPIO port management.",
      "longDescription": "DiscordPiBot is a multifunctional Discord bot hosted on a Raspberry Pi, designed to control home automation devices and automate tasks directly from a Discord server. The bot is written in Python and offers flexible and modular management of the Raspberry Pi's GPIO ports, enabling remote control of connected devices.",
      "features": ["Home automation control via Discord commands", "Modular management of Raspberry Pi GPIO ports", "Automation of recurring tasks", "Docker deployment for simplified management", "Bash scripts for system administration"]
    }
  },
  "components": {
    "organisms": {
      "footer": {
        "text": "© {{year}} ePortfolio - Nicolas Loisy. All rights reserved."
      },
      "navbar": {
      }
    }
  },
  "error": {
    "errorThrow": "Error: {{error}}",
    "errorContent": "An error occurred while loading the content.",
    "403": {
      "title": "403 - Forbidden",
      "description": "You do not have permission to access this page."
    },
    "404": {
      "title": "404 - Not Found",
      "description": "The page you are looking for does not exist."
    },
    "generic": {
      "title": "An error occurred",
      "description": "Something went wrong. Please try again later."
    }
  }
}
