{
  "language_name": "Français",
  "global": {
    "siteName": "Nicolas Loisy",
    "loading": "Chargement...",
    "noContent": "Aucun contenu trouvé",
    "yes": "Oui",
    "no": "Non",
    "redirectCertif": "Voir la certification",
    "redirectProject": "Voir le projet"
  },
  "welcome": "Bienvenue dans notre application",
  "homepage": {
    "title": "Page d'accueil",
    "description": "Ceci est la page d'accueil.",
    "downloadcv": "Télécharger le CV",
    "downloadmemoire": "Télécharger le Mémoire"
  },
  "profile": {
    "name": "Nicolas Loisy",
    "title": "Développeur Web & Intégrateur d'Intelligence Artificielle"
  },
  "social": {
    "github": "https://github.com/Nicolas-Loisy",
    "huggingface": "https://huggingface.co/Nicolas-Loisy",
    "linkedin": "https://www.linkedin.com/in/nicolas-loisy/",
    "email": "nicolas.loisy@yahoo.fr"
  },
  "about": {
    "title": "À propos de moi",
    "description": "Je suis un développeur web passionné par l'informatique dans son ensemble.<br />Ma curiosité me pousse à explorer divers domaines tels que la technologie, l'intelligence artificielle et l'électronique.<br />J'aime trouver des solutions à des problèmes techniques et relever des défis.<br /><br />Chaque jour, j'ai la chance de travailler dans un environnement stimulant où je peux appliquer mes compétences tout en apprenant constamment.<br />Mes passions pour l'informatique et la technologie me permettent de prendre du plaisir à créer et à innover, tout en m'enrichissant en connaissances et en expériences.<br />Mon objectif est de continuer à évoluer dans ce domaine fascinant."
  },
  "skills": {
    "title": "Compétences"
  },
  "experience": {
    "title": "Expériences",
    "date1": "09/2023 - Aujourd'hui",
    "title1": "Développeur Python & Intégrateur d'IA - Eurelis",
    "description1": "Développement de chatbots IA avec système RAG • Prompt engineering • Scraping<br />LlamaIndex • Langchain • Huggingface • GPT • JS<br />Outils : GIT • Jira",
    "date2": "09/2022 - 09/2023",
    "title2": "Développeur PHP & Symfony - Eurelis",
    "description2": "Développement d'un backend et d'un portail client PHP/Symfony • TMA et évolutions diverses sur le site OSAC.AERO<br />PHP • Symfony • JS • MySQL • Jira <br />Outils : Docker • GIT • Mantis Bug Tracker • SonarQube",
    "date3": "04/2022 - 07/2022",
    "title3": "Développeur PHP & Symfony - Eurelis",
    "description3": "Développement d'un backend et d'un portail client PHP/Symfony • Intégration d’une équipe de développement Symfony • TMA et traitement de tickets<br />PHP • Symfony • Twig • HTML • CSS"
  },
  "diplome": {
    "title": "Diplômes",
    "date1": "2023 - 2025",
    "title1": "Master MIAGE - Université Paris Cité (Descartes)",
    "description1": "Master MIAGE - Parcours : Valorisation et protection des données de l'entreprise.<br/> Double compétence en gestion de projet, management et développement, avec une expertise dans la gestion de la donnée.",
    "date2": "2022 - 2023",
    "title2": "L3 MIAGE - IUT Paris Cité (Descartes)",
    "description2": "Acquisition d’une double compétence en gestion de projet et développement logiciel, préparant à des responsabilités techniques et organisationnelles.",
    "date3": "2020 - 2022",
    "title3": "DUT Informatique - IUT de Montreuil",
    "description3": "Maîtrise de Java, C, PHP, SQL, Bash, ainsi que des concepts de réseau, design patterns, sécurité, et logique algorithmique.",
    "date4": "2020",
    "title4": "Bac Scientifique - Lycée Diderot",
    "description4": "Formation générale en sciences."
  },
  "certification": {
    "title": "Certifications",
    "title1": "Certification JavaScript",
    "description1": "Certification complète couvrant des sujets avancés en JavaScript.",
    "year1": "2023",
    "title2": "Certification Python",
    "description2": "Certification complète couvrant des sujets avancés en Python.",
    "year2": "2024",
    "title3": "Certification ChatGPT & Langchain",
    "description3": "Certification sur Langchain, ChatGPT et la maîtrise des systèmes RAG.",
    "year3": "2024",
    "title4": "Sinequa Certified Professional - Associate Certificate",
    "description4": "Attestation de réussite à la formation \"Sinequa: Associate (2025.1) Certification Path\" délivrée par Sinequa University. \nRésumé : Moteur de recherche d'entreprise, Vision, architecture, sécurité, NLP et indexation de la plateforme Sinequa.",
    "year4": "24 octobre 2025",
    "title5": "Sinequa V11 Practical Basics Certificate",
    "description5": "Attestation de réussite à la formation \"Sinequa: Practical Basics Certification (2025.3 - 11.13)\" délivrée par Sinequa - Center of Excellence. \nRésumé : Architecture Sinequa, connecteurs, indexation, interface SBA et recherche.",
    "year5": "24 octobre 2025",
    "title6": "Sinequa Certified Professional - Design Specialist Certificate",
    "description6": "Attestation de réussite à la formation 'Sinequa: Design Specialist (2025.1) Certification Path' délivrée par Sinequa University.\nRésumé : Architecture et sécurité Sinequa, connecteurs, indexation, NLP, moteur, recherche, SBA, plugins, web services et aspects produits.",
    "year6": "30 octobre 2025"
  },
  "terminal": {
    "text1": "Hello, world!",
    "text2": "Intégrateur d'IA",
    "text3": "Développeur PHP",
    "text4": "Développeur Symfony",
    "text5": "We love Eurelis! ♡",
    "text6": "Formation : MIAGE",
    "text7": "La documentation, ma passion!",
    "text8": "MarkIA = MarkDown + IA",
    "text9": "sudo rm -rf /*"
  },
  "linkedin": {
    "title": "Mes Publications LinkedIn"
  },
  "projects": {
    "title": "Mes Projets",
    "exploreButton": "En savoir plus",
    "backToProjects": "Retour aux projets",
    "detailSections": {
      "overview": "Apercu",
      "features": "Fonctionnalites cles",
      "techStack": "Technologies",
      "challenges": "Defis techniques"
    },
    "glados": {
      "title": "GLaDOS",
      "subtitle": "Quand l'IA de Portal controle votre maison",
      "date": "2025",
      "description": "Et si GLaDOS, l'IA culte et sarcastique du jeu Portal, devenait votre assistante vocale a domicile ?\n\n C'est le defi que je me suis lance : lui donner une voix, une personnalite... et surtout le controle de mon environnement connecte. Interaction multimodale (voix, Discord, web), TTS personnalise, domotique locale (IR, GPIO, Bluetooth) et confidentialite (tout tourne sur un Raspberry Pi 5). Technologies : Picovoice, Piper, LlamaIndex, ReAct, LED IR, GPIO, Bluetooth, Pi 5.",
      "longDescription": "GLaDOS est un projet personnel ambitieux qui transforme l'IA iconique du jeu Portal en une veritable assistante vocale domotique. L'objectif etait de creer un systeme complet d'interaction multimodale : commande vocale avec wake word, integration Discord et interface web. Le tout fonctionne integralement sur un Raspberry Pi 5 pour garantir la confidentialite des donnees.\n\nLe systeme utilise Picovoice pour la detection du wake word, Piper pour la synthese vocale avec la personnalite de GLaDOS, et LlamaIndex couple a un agent ReAct pour le raisonnement et l'execution d'actions domotiques.",
      "features": ["Interaction multimodale : wake word vocal, commandes Discord et interface web", "Synthese vocale personnalisee avec la personnalite de GLaDOS (Piper TTS)", "Domotique locale via LED infrarouges, GPIO et Bluetooth", "Architecture privacy-first : tout tourne localement sur Raspberry Pi 5", "Agent ReAct avec LlamaIndex pour le raisonnement et l'execution d'actions", "Detection de wake word avec Picovoice"],
      "challenges": "Le principal defi etait de faire tourner l'ensemble du pipeline (STT, LLM, TTS, domotique) sur un Raspberry Pi 5 avec des performances acceptables. L'optimisation de la latence entre la commande vocale et la reponse de GLaDOS a necessite un travail important sur le pipeline audio et le streaming des reponses."
    },
    "featureEngineering": {
      "title": "LLM4FE - Feature Engineering",
      "subtitle": "Automatisation de feature engineering avec IA",
      "date": "2025",
      "description": "Developpement d'un systeme d'automatisation de feature engineering pour le machine learning. Utilisation de modeles de langage pour generer des features pertinentes a partir de donnees brutes.",
      "longDescription": "LLM4FE est un projet de recherche qui explore l'utilisation de grands modeles de langage (LLM) pour automatiser le processus de feature engineering en machine learning. Le systeme analyse les donnees brutes, comprend leur semantique et genere automatiquement des transformations de features pertinentes pour ameliorer les performances des modeles predictifs.",
      "features": ["Generation automatique de features a partir de donnees brutes via LLM", "Analyse semantique des colonnes et relations entre variables", "Pipeline de transformation et evaluation automatique", "Integration avec les workflows scikit-learn existants"]
    },
    "tweetLearning": {
      "title": "TweetEmotion - Machine Learning",
      "subtitle": "Classification de tweets par emotions via regression logistique",
      "date": "2025",
      "description": "Creation d'un modele de machine learning pour classifier des tweets selon leurs emotions. Pretraitement, vectorisation et entrainement d'un modele supervise pour l'analyse de sentiments.",
      "longDescription": "TweetEmotion est un projet de machine learning supervise qui classifie des tweets selon les emotions qu'ils expriment. Le pipeline complet comprend le pretraitement du texte (nettoyage, tokenisation, lemmatisation), la vectorisation via TF-IDF et l'entrainement d'un modele de regression logistique multiclasse. Le projet inclut une phase d'evaluation avec matrice de confusion et metriques de performance.",
      "features": ["Pretraitement NLP complet : nettoyage, tokenisation, lemmatisation", "Vectorisation TF-IDF pour la representation des textes", "Modele de regression logistique multiclasse", "Evaluation avec matrice de confusion et metriques detaillees"]
    },
    "enigma": {
      "title": "Enigma",
      "subtitle": "Projet universitaire sur la cryptologie",
      "date": "2025",
      "description": "Reproduction de la logique de la machine Enigma dans le cadre d'un projet universitaire. Ce projet vise a comprendre et a implementer les concepts de cryptologie utilises par la machine Enigma."
    },
    "ePortfolio": {
      "title": "ePortfolio",
      "subtitle": "Portfolio personnel interactif",
      "date": "2024",
      "description": "Developpement d'un portfolio personnel interactif concu pour presenter mes competences techniques, mes experiences professionnelles et mes projets personnels. Ce projet a ete developpe avec React et TypeScript.",
      "longDescription": "Ce portfolio interactif est une application React/TypeScript moderne qui presente de maniere dynamique mon parcours professionnel, mes competences et mes realisations. Le site supporte le mode sombre/clair, l'internationalisation (FR/EN) et est entierement responsive. Il est heberge sur un Raspberry Pi via Firebase Hosting.",
      "features": ["Interface responsive avec support mobile", "Mode sombre et clair avec persistance", "Internationalisation complete (Francais / Anglais)", "Terminal anime avec texte defilant", "Navigation par ancres avec fleches", "Hebergement sur Raspberry Pi via Firebase"]
    },
    "markIA": {
      "title": "MarkIA",
      "subtitle": "Site de documentation technique avec IA",
      "date": "2024",
      "description": "Developpement d'une plateforme web de redaction et stockage de documentation integrant une intelligence artificielle pour simplifier la recherche. Le projet inclut un chatbot alimente par une base de connaissances (les documentations) et un systeme RAG (Retrieval-Augmented Generation).",
      "longDescription": "MarkIA est une plateforme web de documentation technique augmentee par l'intelligence artificielle. Elle permet la redaction, le stockage et la recherche intelligente dans des documentations en Markdown. Le systeme integre un chatbot IA qui utilise un systeme RAG (Retrieval-Augmented Generation) pour repondre aux questions des utilisateurs en se basant sur la base de connaissances constituee par les documentations.",
      "features": ["Editeur Markdown integre pour la redaction de documentation", "Chatbot IA avec systeme RAG (Retrieval-Augmented Generation)", "Recherche semantique dans la base de connaissances", "Authentification et gestion des utilisateurs via Firebase", "Stockage des documentations dans MongoDB", "Integration avec Langchain et Hugging Face pour le pipeline IA"]
    },
    "jobo": {
      "title": "JOBO",
      "subtitle": "Application mobile pour valoriser les metiers des industries et le Made in France",
      "date": "2024",
      "description": "Creation d'une application mobile innovante qui reconnait les objets via la camera et identifie les metiers d'artisanat ou d'industrie impliques dans leur fabrication. Developpe avec React Native et un modele de vision IA.",
      "longDescription": "JOBO est une application mobile React Native qui utilise la vision par ordinateur pour reconnaitre des objets du quotidien et identifier les metiers d'artisanat et d'industrie impliques dans leur fabrication. L'objectif est de valoriser le Made in France et les savoir-faire industriels en permettant aux utilisateurs de decouvrir les metiers derriere les objets qui les entourent.",
      "features": ["Reconnaissance d'objets par camera via modele de vision IA", "Base de donnees des metiers industriels et artisanaux", "Interface mobile React Native intuitive", "Backend API avec MongoDB et Hugging Face"]
    },
    "meteoApp": {
      "title": "MeteoApp",
      "subtitle": "Application mobile d'alertes climatiques",
      "date": "2023",
      "description": "Une application personnalisable pour alerter les utilisateurs sur les evenements climatiques extremes dans leur region. Inclut des notifications en temps reel et des previsions meteorologiques locales.",
      "longDescription": "MeteoApp est une application mobile React Native concue pour alerter les utilisateurs sur les evenements climatiques extremes dans leur region. L'application offre des notifications en temps reel, des previsions meteorologiques locales personnalisables et une interface intuitive pour suivre les conditions meteo."
    },
    "eMortels": {
      "title": "eMortels",
      "subtitle": "Plateforme pour l'Academie Francaise",
      "date": "2023",
      "description": "Conception et developpement d'une plateforme educative pour promouvoir la maitrise de la langue francaise. Ce projet propose des exercices interactifs et un acces aux ressources linguistiques.",
      "longDescription": "eMortels est une plateforme educative web concue pour promouvoir la maitrise de la langue francaise. Developpee avec React, Node.js et MongoDB, elle propose des exercices interactifs et un acces aux ressources linguistiques de l'Academie Francaise."
    },
    "discordPiBot": {
      "title": "DiscordPiBot",
      "subtitle": "Bot Discord pour la domotique",
      "date": "2022",
      "description": "Un bot Discord multifonction heberge sur un Raspberry Pi, concu pour controler des appareils domotiques et automatiser des taches dans un serveur Discord. Ecrit en Python pour une gestion flexible et modulaire des ports GPIO.",
      "longDescription": "DiscordPiBot est un bot Discord multifonction heberge sur un Raspberry Pi, concu pour controler des appareils domotiques et automatiser des taches directement depuis un serveur Discord. Le bot est ecrit en Python et offre une gestion flexible et modulaire des ports GPIO du Raspberry Pi, permettant le controle d'appareils connectes a distance.",
      "features": ["Controle domotique via commandes Discord", "Gestion modulaire des ports GPIO du Raspberry Pi", "Automatisation de taches recurrentes", "Deploiement Docker pour une gestion simplifiee", "Scripts Bash pour l'administration systeme"]
    }
  },
  "components": {
    "organisms": {
      "footer": {
        "text": "© {{year}} ePortfolio - Nicolas Loisy. Tous droits réservés."
      },
      "navbar": {
      }
    }
  },
  "tweetEmotionDetail": {
    "title": "TweetEmotion - Benchmark ML",
    "subtitle": "Étude comparative de 3 modèles de classification de sentiments",
    "date": "2025",
    "sections": {
      "intro": {
        "title": "Introduction",
        "content": "Ce projet est une étude comparative de trois approches de machine learning pour la classification de sentiments sur des tweets. L'objectif était d'évaluer les performances de modèles de complexité croissante : un modèle custom entraîné from scratch, un modèle pré-entraîné Hugging Face, et GPT-4o-mini via l'API OpenAI."
      },
      "methodology": {
        "title": "Méthodologie",
        "content": "L'étude suit un protocole rigoureux : préparation des données, entraînement/configuration des modèles, prédiction sur un jeu de test commun, et évaluation avec des métriques standardisées. Le dataset utilisé est un corpus de tweets annotés avec 3 classes de sentiments : positif, négatif et neutre."
      },
      "models": {
        "title": "Modèles Comparés",
        "intro": "Trois approches distinctes ont été évaluées, représentant différents niveaux de complexité et de coût :"
      },
      "gptImplementation": {
        "title": "Implémentation GPT-4o-mini",
        "content": "L'intégration de GPT-4o-mini utilise la fonctionnalité de Structured Output de l'API OpenAI. Cela garantit que les réponses respectent un schéma défini avec des classes de sentiments précises, évitant les erreurs de parsing et assurant la cohérence des prédictions."
      },
      "metrics": {
        "title": "Métriques d'Évaluation",
        "content": "Les trois métriques principales utilisées pour comparer les modèles sont la Precision, le Recall et le F1-Score. Ces métriques permettent d'évaluer finement la qualité des prédictions pour chaque classe de sentiment."
      },
      "results": {
        "title": "Résultats Expérimentaux",
        "content": "Les résultats montrent des différences significatives entre les trois approches, tant en termes de précision que de temps d'exécution. Le modèle Hugging Face se distingue par le meilleur équilibre performance/coût."
      },
      "findings": {
        "title": "Conclusions Clés"
      },
      "conclusion": {
        "title": "Conclusion",
        "content": "Cette étude démontre que le choix du modèle dépend fortement du contexte d'utilisation. Pour des applications nécessitant une haute précision avec un budget limité, les modèles pré-entraînés Hugging Face représentent un excellent compromis. GPT-4o offre des performances exceptionnelles mais à un coût significatif. Les modèles custom restent pertinents pour des cas d'usage spécifiques nécessitant un contrôle total sur le pipeline."
      }
    },
    "models": {
      "custom": {
        "title": "Modèle Custom (Régression Logistique + TF-IDF)",
        "description": "Modèle entraîné from scratch utilisant une vectorisation TF-IDF et une régression logistique multiclasse. Pipeline complet de prétraitement NLP incluant nettoyage, tokenisation et lemmatisation. Avantage : contrôle total et coût nul en inférence."
      },
      "huggingface": {
        "title": "Hugging Face (RoBERTa)",
        "description": "Modèle pré-entraîné cardiffnlp/twitter-roberta-base-sentiment, spécifiquement fine-tuné pour l'analyse de sentiments sur Twitter. Architecture Transformer avec embeddings contextuels. Excellent rapport performance/facilité d'utilisation."
      },
      "gpt": {
        "title": "GPT-4o-mini (OpenAI API)",
        "description": "Utilisation de l'API OpenAI avec Structured Output pour garantir un format de réponse cohérent. Prompting optimisé pour la classification de sentiments. Haute précision mais coût API et latence plus élevés."
      }
    },
    "findings": {
      "huggingface": {
        "title": "🏆 Hugging Face - Meilleur rapport qualité/prix",
        "content": "Le modèle RoBERTa atteint les meilleures performances globales (F1-Score ~0.85) avec un temps d'exécution raisonnable et sans coût API. Recommandé pour la plupart des cas d'usage production."
      },
      "gpt": {
        "title": "💰 GPT-4o-mini - Haute précision, coût élevé",
        "content": "Performances comparables à Hugging Face mais avec un coût API significatif et une latence plus élevée. Pertinent pour des analyses one-shot ou quand la flexibilité du prompting est critique."
      },
      "custom": {
        "title": "⚙️ Custom - Contrôle total, performances modestes",
        "content": "Le modèle custom offre des performances correctes mais inférieures aux modèles pré-entraînés. Son avantage réside dans le contrôle total du pipeline et l'absence de dépendance externe."
      }
    },
    "images": {
      "workflow": "Schéma du workflow de l'étude comparative",
      "outputStructure": "Structure de sortie définie pour GPT (Enums Python)",
      "gptApiCall": "Code d'appel à l'API OpenAI avec Structured Output",
      "metricsComparison": "Comparaison des métriques (Precision, Recall, F1) par modèle",
      "executionTime": "Temps d'exécution par modèle",
      "confusionMatrices": "Matrices de confusion des trois modèles"
    }
  },
  "error": {
    "errorThrow": "Erreur : {{error}}",
    "errorContent": "Une erreur est survenue lors du chargement du contenu.",
    "403": {
      "title": "403 - Interdit",
      "description": "Vous n'avez pas la permission d'accéder à cette page."
    },
    "404": {
      "title": "404 - Introuvable",
      "description": "La page que vous recherchez n'existe pas."
    },
    "generic": {
      "title": "Une erreur s'est produite",
      "description": "Quelque chose a mal tourné. Veuillez réessayer plus tard."
    }
  }
}
